{
  "words": {
    "lynch": ".w\nبه طور غیرقانونی و خارج از چارچوب قانونی، معمولاً توسط جمعی از مردم، کسی را به جرم واقعی یا فرضی بدون محاکمه اعدام کردن، اغلب با آویزان کردن\nlinch\nTo kill someone, especially by hanging, without a legal trial, usually by a mob. It is an illegal and violent act of punishment carried out by a group of people.",
    "incarceration": ".w  \nحبس  \nin-kahr-suh-rey-shun  \nThe state of being confined in prison; imprisonment.",
    "incongruities": ".w  \nناهماهنگی‌ها  \nin-kon-groo-i-teez  \nDiscrepancies or inconsistencies that are not in harmony or agreement with each other.",
    "impugn": ".w  \nتخریب کردن و زیر سوال بردن  \nim-pyoon  \nto call into question or challenge the validity or integrity of something; to criticize or attack someone's work or character.",
    "semi-precarious": ".w  \nنیمه ناامن  \nsem-ee-pri-kair-ee-uhs  \nPartially unstable or uncertain; in a state that is not completely secure, but not entirely hopeless either.",
    "articulacy": ".w  \nفصاحت  \nahr-tik-yuh-luh-see  \nThe ability to express oneself clearly and effectively in speech or writing.",
    "morose": ".w  \nغمگین و افسرده  \nmuh-rohs  \nsad, gloomy, or sullen; feeling or expressing a sense of unhappiness or discontent.",
    "esteemed": ".w  \nمحترم  \nih-steemed  \nRespected and admired, often used to convey a sense of honor towards a person, especially in an academic or professional context.",
    "cede": ".w  \nواگذار کردن  \nseed  \nto give up control or responsibility for something; to surrender or yield something to someone else.",
    "reciprocal": ".w  \nمتقابل  \nri-sip-ruh-kul  \nInvolving mutual exchange or interaction; in this context, it means that the links must exist in both directions or between both parties involved.",
    "scrutiny": ".w  \nدقت  \nskroo-tuh-nee  \ncareful examination or inspection; close observation of something to ensure accuracy or quality.",
    "exhilarating": ".w  \nهیجان‌انگیز  \neg-zil-uh-rey-ting  \ncausing strong feelings of excitement and happiness; thrilling.",
    "satiation": ".w  \nسیر شدن  \nsuh-tee-ay-shun  \nThe state of being satisfied or having had enough of something, especially food. It refers to the feeling of fullness or contentment after eating.",
    "roster": ".w  \nفهرست  \nros-ter  \na list or register of names or items, often used to organize people or things in a particular context, such as a list of staff members or participants.",
    "infuriated": ".w  \nعصبانی و خشمگین  \nin-fyoo-ree-ay-tid  \nextremely angry; filled with rage.",
    "botched": ".w  \nبدساز، خراب‌شده  \nbotched  \nmade or done badly; to fail in a task or project, often resulting in poor quality or mistakes.",
    "fiefdoms": ".w  \nحکومت‌های فئودالی  \nfief-dums  \nTerritorial divisions or domains ruled by a lord or noble, often associated with feudal systems where a vassal holds land from a higher lord in exchange for loyalty and service.",
    "resentment": ".w  \nکینه  \nrih-sent-muhnt  \na feeling of anger or displeasure about someone or something that one feels has wronged them.",
    "Uncompromising": ".w  \nغیرقابل سازش  \nuhn-kom-pruh-mizing  \nNot willing to change one's views or actions; steadfast and resolute in principles or beliefs.",
    "solvent": ".w  \nقادر به پرداخت بدهی  \nsol-vuhnt  \nA solvent is an entity (usually a person or business) that is able to meet its financial obligations as they come due, meaning they have enough assets to cover their debts.",
    "piety": ".w  \nتقوی  \npahy-uh-tee  \nThe quality of being religious or reverent; devotion to God and adherence to moral principles.",
    "plea": ".w  \nدرخواست  \nplee  \nA plea is a request made in an urgent or emotional manner, often in a legal context where someone is formally stating their case or defense.",
    "precede": ".w  \nقبل آمدن (ghabl amadān)  \nprih-seed  \nTo come before something in time, order, or position.",
    "detour": ".w  \nانحراف  \ndee-toor  \nA detour is a longer route taken to avoid an obstacle or a difficult situation, often used when the direct path is blocked or unsafe.",
    "harangued": ".w\nنصیحت شد و موعظه شد\nhuh-rang-d\nto be lectured or criticized in a forceful or aggressive manner, often about something considered wrong or inappropriate.",
    "palpable": ".w  \nقابل احساس  \npal-puh-buhl  \nEasily perceived or noticeable; able to be felt or touched, often used to describe something that is strong and evident.",
    "corralled": ".w  \nجمع آوری کردند  \nkuh-rald  \nto gather together or confine a group of animals, especially livestock, within a certain area or enclosure.",
    "amicably": ".w  \nدوستانه  \nuh-MIK-uh-blee  \nin a friendly and peaceful manner, without conflict or disagreement.",
    "boffin": ".w  \nدانشمند، نبوغی  \nbof-in  \nA slang term for a scientist or expert, often used to describe someone who is highly knowledgeable in a specific field but may lack practical skills or common sense in other areas.",
    "vicinity": ".w  \nنزدیکی  \nvi-sin-i-tee  \nthe area or region near a particular place; proximity.",
    "veered": ".w  \nانحراف یافت  \nveer-ed  \nto change direction suddenly or to shift away from a particular course or position.",
    "moot": ".w  \nبی‌معنی (به دلیل اینکه اهمیتش کم است)  \nmoot (mu:t)  \nHaving little or no practical relevance or significance; often used to describe a point that is debatable or of no practical importance.",
    "disarticulating": ".w  \nتفکیک کردن  \ndis-ahr-ti-kyuh-lay-ting  \nTo disarticulate means to separate or break apart the components of something, often used in the context of analyzing or breaking down complex ideas or structures into simpler parts.",
    "miscreants": ".w  \nمجرمان (یا بدکاران)  \nmis-kree-uhnts  \nIndividuals who behave in a morally wrong or criminal way; wrongdoers or those who engage in immoral conduct.",
    "rung": ".w  \nپله  \nrung  \nA level or step in a hierarchy or progress, often referring to moving up in status or position.",
    "impedance": ".w  \nعدم تطابق امپدانس  \nim-pe-dance  \nImpedance refers to the resistance that a system or component presents to the flow of electric current, particularly in the context of electrical circuits. In this sentence, \"impedance mismatch\" suggests that there is a discrepancy or incompatibility between the scaling of the array and the way memory is allocated (arena allocation).",
    "condescending": ".w  \nتحقیرآمیز  \nkənˈdɛsənˌdɪŋ  \nHaving or showing an attitude of patronizing superiority; treating others as if they are less important or knowledgeable.",
    "germination": ".w  \nجوانه‌زنی  \njur-muh-ney-shun  \nThe process of a seed beginning to grow and develop into a new plant. In this context, it refers to the early stages of developing a startup.",
    "permissive": ".w  \nسهل‌گیر  \npərˈmɪsɪv  \nPermissive means allowing or characterized by a tendency to allow or tolerate something. In this context, it suggests that the model is too lenient or accommodating when evaluating startup ideas.",
    "remittances": ".w  \nانتقال وجه  \nremittances  \nMoney that is sent back home, often by migrants to their families in their country of origin.",
    "mortified": ".w  \nشرمنده  \nmawr-tuh-fahyd  \nextremely embarrassed or ashamed; feeling very uncomfortable due to a mistake or awkward situation.",
    "Bellicose": "bel-i-kohs  \nستیزه‌جو  \n\"Bellicose\" is an adjective used to describe someone who is eager to fight or prone to aggression and hostility. This term is often used in a political or social context to describe nations, groups, or individuals that demonstrate an aggressive or warlike behavior.",
    "peyote": "pey-oh-tee  \nپیوت  \nPeyote is a small, spineless cactus native to parts of North America. It is known for its psychoactive properties due to the presence of mescaline. The cactus has been traditionally used in Native American religious rituals for its hallucinogenic effects.",
    "prejudice": "prej-uh-dis  \nتبعیض، پیش‌داوری، غرض‌ورزی  \n\"Prejudice\" refers to an unjustified or incorrect attitude (usually negative) towards an individual based solely on the individual's membership in a social group. This can be about race, ethnicity, religion, or other factors. It often involves preconceived opinions that are not based on reason or actual experience.",
    "rhetoric": "**rhet-er-ik**\n\nبلاغت / سخن‌وری\n\n\"Rhetoric\" is a noun used to refer to the art of effective or persuasive speaking or writing, often using figures of speech and other compositional techniques. It can also mean language designed to have a persuasive or impressive effect on its audience, but which is often regarded as lacking in sincerity or meaningful content. \n\nIn academic and formal contexts, \"rhetoric\" is often associated with the classical study of persuasive techniques, dating back to ancient philosophers like Aristotle. In a more modern and sometimes negative context, it can imply speech or writing that sounds impressive but is actually insincere or empty.",
    "lieutenants": "loo-ten-uhnts (American) / lef-ten-uhnts (British)\n\nنایب / ستوان\n\n\"Lieutenants\" is a plural noun used in a military context and refers to a rank of officer in the armed forces, typically just below captain. This term indicates individuals who have authority and responsibilities within their unit. The Persian translation \"نایب\" or \"ستوان\" is used to refer to this role in military or organizational hierarchies.",
    "treatise": "tree-tis  \nرساله\n\nA \"treatise\" is a formal and systematic written discourse on a particular subject. It often involves a detailed and methodical discussion aimed at thoroughly examining the subject matter. Treatises are usually more comprehensive than essays and are used in academic, philosophical, or scientific discussions.",
    "blasphemy": "blas-fuh-mee  \nکفر  \n\"Blasphemy\" is a noun used to describe speech or actions that show disrespect or irreverence towards something considered sacred or holy, particularly related to religion. In many contexts, it refers to acts or expressions that are offensive to religious beliefs or values.",
    "eugenicist": "yu-jen-uh-sist  \nبه‌نژادپرست  \n\"Eugenicist\" is a noun that refers to a person who supports or advocates for the practice of eugenics. Eugenics is a set of beliefs and practices aimed at improving the genetic quality of a human population, often by promoting reproduction among people with desired traits and reducing reproduction among those with undesirable traits. The eugenics movement has been controversial and criticized for its ethical implications, including its association with harmful policies and discrimination.",
    "stratum": "stra-tuhm  \nلایه / طبقه  \n\n\"Stratum\" is a noun that primarily refers to a layer or a level within a system, structure, or series of layers. The term is often used in various contexts, such as:\n\n1. Geological context: It refers to a single layer of sedimentary rock or soil with internally consistent characteristics that distinguish it from other layers.  \n   - لایه‌ای از سنگ یا خاک با ویژگی‌های مجزا\n\n2. Social context: It can describe a level of society made up of people with similar social, economic, or educational status.  \n   - طبقه‌ای از جامعه با وضعیت اجتماعی، اقتصادی یا آموزشی مشابه\n\nThe word \"stratum\" is commonly used in both geological and sociological discussions, making it versatile depending on the context. The plural form of \"stratum\" is \"strata.\"",
    "stocks": "stoks  \n1. سهام (sahám)  \n   Stocks as financial instruments: Refers to shares or equity in a company, representing ownership in a corporation and a claim on part of the company's assets and earnings.  \n\n2. کالاها (káláhá)  \n   Stocks as merchandise: Refers to goods or merchandise kept on the premises of a shop or warehouse and available for sale or distribution.  \n\n3. انبار (anbár)  \n   Stocks as storage: Refers to a supply of goods or materials kept for future use or sale.  \n\n4. پایه‌ها (páyehá)  \n   Stocks as supports: Refers to the supports or pillars, especially in agriculture or old methods of punishment (e.g., pillory), though this is more archaic in usage today.",
    "clergy": "cler-jee  \nروحانیون / روحانیت  \n\"Clergy\" refers to the body of people who are ordained for religious duties, especially in the Christian Church. It commonly includes priests, ministers, and other religious leaders who have authority within their religious community. This term is typically used to denote a group rather than individuals.",
    "drew disproportionately": "droo dis-proh-pawr-shuh-nit-lee  \nبه‌طور نامتناسب جلب کرد\n\nIn English, \"drew disproportionately\" is a phrase that generally means something attracted attention or resources more than what would be considered fair or usual in comparison to other things, often in a way that isn't balanced or equitable. This phrase can be used in various contexts, such as discussing how media attention is focused more on one event over others or how a budget might allocate more funds to one area than others, without a balanced justification.",
    "parson": "par-son  \nکشیش  \nA \"parson\" is an old term used to describe a member of the clergy, particularly a Protestant pastor or minister who is responsible for a parish. It is a less commonly used word today but was more prevalent in historical contexts to refer to religious leaders within the Christian church.",
    "counterfeiting": "coun-ter-feit-ing\nجعل\nCounterfeiting refers to the act of making an imitation or replica of an object, especially money, with the intent to deceive and defraud. It is typically associated with illegal activities where fake versions of items like currency, documents, or branding (such as luxury goods) are produced and sold as if they were genuine.",
    "binge": "binj\n\nزیاده‌روی\n\n\"Binge\" typically refers to excessive or uncontrolled indulgence in an activity or consumption, particularly in eating or drinking. In modern contexts, it often relates to \"binge-watching,\" which is watching multiple episodes of a TV show in a single sitting.",
    "nimble": "nim-buhl  \nچابک  \n\"Nimble\" is an adjective used to describe someone or something that is quick and light in movement or action, demonstrating agility and ease. It can also refer to mental quickness and cleverness.",
    "prospering": "pros-per-ing  \nپیشرفت کردن / رونق گرفتن\n\n1. پیشرفت کردن (Pishraft kardan)\n   - Context: Used to describe someone or something that is making progress or advancing in a positive way, often in terms of success or wealth. For example, a business or individual who is doing well financially and gaining success over time.\n\n2. رونق گرفتن (Ronaq gereftan)\n   - Context: Commonly used to describe a situation, economy, or business that is thriving or flourishing, often after a period of difficulty or stagnation.\n\n\"Prospering\" is used to convey growth, success, and thriving conditions, whether it be in personal endeavors, businesses, or economies. It emphasizes positive development and improvement.",
    "perennial": "puh-ren-ee-uhl  \n*دائم* / *همیشگی* / *چندساله*\n\"Perennial\" is an adjective that generally means lasting for a long or seemingly infinite time. It can also refer to a plant that lives for more than two years. Here are the contexts in which it is used:\n\n1. **Daim (دائم) / Hamishagi (همیشگی):**  \n   This meaning is used to describe something that is enduring or constantly recurring. For example, a perennial problem is one that persists over time.\n\n2. **Chandasaleh (چندساله):**  \n   In the context of botany, \"perennial\" refers to plants that live for more than two years. Unlike annual or biennial plants, perennials grow and bloom over multiple seasons.",
    "acumen": "uh-kyoo-muhn  \nتیزهوشی، فراست  \nThe word \"acumen\" is a noun that refers to the ability to make good judgments and quick decisions, often in a particular domain or field. It describes sharpness or keen insight, especially in practical matters.",
    "toppling": "top-ling\n\nسرنگونی\n\"Toppling\" is a noun or verb that refers to the act of overturning or causing something to fall. It is often used in the context of bringing down a government, regime, or structure. For example, \"toppling a statue\" refers to making a statue fall from its position, and \"toppling a government\" means overthrowing it.",
    "imbecile": "im-buh-seel\n\nابله\n\n\"Imbecile\" is a noun used to refer to a person who is considered to be very foolish or lacking in common sense. Historically, it was also used as a term to describe someone with a mental disability, but this usage is now considered outdated and offensive. In modern usage, it's often used pejoratively to describe someone's actions as senseless or idiotic.",
    "imprudent": "im-proo-duhnt  \nبی‌ملاحظه، نسنجیده  \n\"Imprudent\" is an adjective used to describe someone who is not showing care for the consequences of an action; it refers to behavior that is unwise, rash, or lacking in careful consideration.",
    "ingrate": "in-greyt  \nناسپاس  \nThe word \"ingrate\" is a noun used to describe a person who is ungrateful or does not show appreciation for the kindness or benefits they have received from others. It conveys a sense of unthankfulness or lack of gratitude.",
    "lurch": "lurch   \nلِرچ\n\n1. تلوتلو خوردن  \n- To make an abrupt, unsteady, uncontrolled movement or series of movements; stagger. This is commonly used to describe a physical motion, like when a vehicle suddenly moves or stops, or a person stumbles.\n\n2. بی‌خبر رها کردن  \n- To leave someone abruptly in a difficult situation without assistance or support. This usage is more metaphorical and refers to abandoning someone unexpectedly.\n\nIn summary, \"lurch\" can refer to a sudden, awkward movement, often indicating a lack of control, or it can imply leaving someone in difficulties without help.",
    "neglect": "nega-lekt  \nغفلت کردن / بی‌توجهی کردن  \n\"Neglect\" is a verb used to describe the act of not giving enough care or attention to someone or something. It can also be a noun, referring to the state of being uncared for. In Persian, \"غفلت کردن\" is used when someone fails to take care of something or someone due to carelessness, while \"بی‌توجهی کردن\" is used more generally for instances of disregard or omission.",
    "candid": "kan-did\n\nبی‌پرده، صادق\n\n\"Candid\" is an adjective used to describe someone who is honest and straightforward, often expressing opinions or feelings in an open and sincere manner. It can also refer to something that is unposed or natural, especially in photography.",
    "meritocracy": "mer-i-tok-ruh-see\nشایسته‌سالاری\n\"Meritocracy\" is a system or society in which individuals are rewarded, selected, or promoted based on their talents, abilities, and achievements rather than on their social status, family background, or wealth. In such a system, people are given opportunities and roles according to their merits and contributions.",
    "non-solicitation": "non-solicitation: non-suh-lis-i-tey-shuhn\n\nعدم درخواست\nThe term \"non-solicitation\" is commonly used in legal and business contexts. It refers to an agreement where one party agrees not to solicit or entice employees or customers away from another party. This is often part of employment contracts or business sales to prevent one party from taking advantage of the other's connections or relationships.",
    "Compersion": "com-per-zhun\n\nهمدلی در شادی دیگران\n\n\"Compersion\" is a term used to describe the feeling of joy one gets when they see someone else experience happiness, particularly in the context of polyamorous relationships. It refers to the opposite of jealousy, where instead of feeling envious or threatened by a partner's involvement with someone else, a person feels happiness and joy for their partner's happiness. This term is relatively uncommon and is primarily used in discussions around non-monogamous relationships.",
    "squirm": "squirm\n\nskwurm  \nوول خوردن  \n\"Squirm\" is a verb that means to twist your body from side to side, often because you are uncomfortable, nervous, or feeling embarrassed. It can also describe the movement of something like a worm. The word implies a kind of restless, wriggling motion.",
    "loudhailer": "loud-hey-ler  \nبلندگو دستی  \nA \"loudhailer\" is a portable, hand-held device used to amplify a person's voice, commonly referred to as a megaphone. It is often used in situations where someone needs to speak to a large group, such as at public events, protests, or sports gatherings.",
    "shunned": "shuhnd  \nطرد شده / کنار گذاشته شده  \n\"Shunned\" is the past participle of \"shun,\" which means to deliberately avoid, ignore, or reject someone or something. This action often involves social exclusion or ostracism, typically because of disapproval or prejudice.",
    "demagogues": "dem-uh-gogs  \nدموکراسی‌نماها  \n\n\"Demagogues\" refers to political leaders who seek support by appealing to the desires and prejudices of ordinary people rather than by using rational arguments. In Persian, \"دموکراسی‌نماها\" captures the idea of leaders who manipulate populist emotions for their gain.",
    "aggrieved": "ag-greevd  \nمظلوم، داغدار، ناراضی  \n\n1. مظلوم: Used to describe someone who feels unfairly treated or wronged.  \n2. داغدار: Used when someone is feeling grief or sorrow, particularly after experiencing a significant loss.  \n3. ناراضی: Used to convey dissatisfaction or resentment due to unjust treatment.  \n\n\"Aggrieved\" is an adjective used to describe a feeling of injustice or distress, often due to unfair treatment or significant emotional pain.",
    "content": "Sure! Let's look at the word \"content,\" which has multiple meanings based on context:\n\n1. **When \"content\" is a noun referring to the material contained within something:**\n\n   Pronunciation: kon-tent\n\n   Persian: محتوا\n\n   Meaning in English: \"Content\" as a noun refers to what is inside something, such as the material included in a book, website, or container.\n\n2. **When \"content\" is an adjective describing a state of satisfaction:**\n\n   Pronunciation: kuhn-tent\n\n   Persian: راضی / خشنود\n\n   Meaning in English: \"Content\" as an adjective describes someone who is satisfied, pleased, or happy with their situation. \n\nEach pronunciation and meaning change based on whether \"content\" is used as a noun or an adjective, leading to different translations in Persian.",
    "ludicrous": "loo-di-kruhs  \nمضحک  \n\"Ludicrous\" is an adjective used to describe something that is so absurd or ridiculous that it is laughable. It often refers to situations, actions, or ideas that are obviously unreasonable or foolish.",
    "garrote": "gar-rot\n\nخفه‌کننده، طناب خفه‌کن\n\n\"Garrote\" refers to a method of execution or assassination by strangulation, typically using a cord, rope, or wire. Historically, it has also been a form of capital punishment where a person is executed by strangulation using a device. The term can be used more generally to describe any scenario where someone is forcibly strangled using a similar tool.",
    "melancholy": "me-luhn-kol-ee\n\nمالیخولیا / افسردگی\n\n\"Melancholy\" is a noun and sometimes an adjective used to describe a deep, persistent sadness or sorrow. As a noun, it refers to a state of sadness, and as an adjective, it describes a feeling or atmosphere filled with or evoking sadness. Historically, it was also associated with a condition of deep, pensive thoughtfulness often tinged with sadness.",
    "proponent": "proh-poh-nuhnt  \nطرفدار  \n\"Proponent\" is a noun used to describe someone who advocates, supports, or argues in favor of a particular idea, plan, or cause.",
    "outrage": "out-reyj  \nخشم  \n\"Outrage\" is a noun that refers to an intense feeling of anger or shock, typically about something perceived as unjust or offensive.  \n\nout-reyj  \nتوهین  \n\"Outrage\" can also refer to an action or event that causes a strong reaction of anger or hurt feelings because it is thought to be morally wrong or disrespectful.",
    "Empirically": "em-pir-i-kuh-lee  \nبه‌طور تجربی  \n\"Empirically\" is an adverb used to describe something that is based on, concerned with, or verifiable by observation or experience rather than theory or pure logic.",
    "sedation": "se-dey-shuhn\n\nتسکین، آرام‌بخشی\n\n\"Sedation\" refers to the process of calming or inducing sleepiness in someone, often through the use of medication. It is commonly used in medical contexts to help patients relax before or during a procedure.",
    "patter": "pat-er\n\n1. صدای ضربات ملایم\n   - \"Patter\" refers to the sound of a series of light, rapid taps or beats, like raindrops hitting a surface. \n\n2. وراجی کردن\n   - In some contexts, \"patter\" can mean speaking rapidly, often in an almost rhythmic, casual way, typically without saying anything important. This can describe a kind of light, fast talk, like a salesperson's pitch.",
    "procession": "proh-sesh-uhn  \nرژه / کاروان / صف  \n\"Procession\" is a noun used to describe a group of people or vehicles moving forward in an orderly fashion, often as part of a ceremony or event. It is commonly used in contexts like a funeral procession or a ceremonial parade.  \n\n- **رژه (rezhé):** Typically used to describe a formal parade, often with military or ceremonial connotations.\n- **کاروان (kârvan):** This term can refer to a procession of people, vehicles, or animals traveling together, often for a specific purpose or journey.\n- **صف (saf):** Literally meaning \"line,\" this can also refer to a group of people or things moving in an organized sequence, though it's less formal than \"procession.\"",
    "yelped": "yelpt  \nجیغ زد، فریاد زد  \n\"Yelp\" is a verb that describes a short, sharp cry, typically made by a dog or a person. It is often used to express sudden pain or surprise.",
    "shimmering": "shim-er-ing  \nدرخشان، تابان  \n\"Shimmering\" is an adjective used to describe something that shines with a flickering or tremulous light. It often refers to a surface or an object that reflects light in a way that appears to vary or tremble. This can be seen in water, metallic surfaces, or even fabrics that catch light, producing a soft, often pleasant gleam or glimmer.",
    "startling": "stahr-tl-ing  \nشگفت‌انگیز، حیرت‌آور\n\n\"Startling\" is an adjective used to describe something that is very surprising, shocking, or alarming. It can refer to an unexpected event, fact, or appearance that catches someone off guard, often causing a sudden reaction or strong emotion.",
    "scolded": "scolded  \n/skohld-id/  \nسرزنش کرد  \n\n\"Scolded\" is the past tense of the verb \"scold,\" which means to reprimand or criticize someone angrily for something they have done. It is often used in the context of speaking to children or subordinates when they have behaved improperly or disobediently.",
    "startled": "start-uhld  \nوحشت‌زده، متحیر  \n\"Startled\" is an adjective used to describe someone who has been suddenly surprised or frightened, typically causing a quick reaction. It refers to a momentary shock or jolt, often due to an unexpected event or noise.",
    "unobtrusively": "un-uhb-troo-siv-lee  \nبه‌طور نامحسوس، به‌طور غیر جلب توجه  \n\"Unobtrusively\" is an adverb used to describe an action done in a way that does not attract attention or cause disturbance. It implies being subtle, discreet, or inconspicuous in behavior or presence.",
    "ravenously hungry": "ray-vuh-nuhs-lee huhng-gree  \nبسیار گرسنه  \n\"Ravenously hungry\" is an expression used to describe an intense level of hunger, where a person feels extremely eager to eat, often implying a strong, urgent need for food.",
    "stature": "stach-er\n\n1. قامت\n2. شخصیّت\n\n1. Height or physical build of a person or animal.\n2. Importance or reputation gained by ability or achievement. \n\n\"Stature\" can refer to the physical height or appearance, but it often also metaphorically refers to someone's reputation or standing in terms of achievements or character.",
    "diluted": ".word\nDefinition:\n1. :weakened or thinned by or as if by having been mixed with something else (such as water)\n2. :having a decreased per share value due to an increase in the total number of shares\nExamples:\nNo examples found.",
    "Of course I could have had this back home just by asking for it, but it would have been considered tacky.\n\n*\n\n*--Here excess is prestige and prestige is displayed by excess. Every piece of furniture in here was hand-made by a skilled human craftsman": "Certainly! Here’s the translation and explanation for the given English phrase:\n\n**Phrase: Of course I could have had this back home just by asking for it, but it would have been considered tacky. Here excess is prestige and prestige is displayed by excess. Every piece of furniture in here was hand-made by a skilled human craftsman.**\n\n**Pronunciation:**\nuhv kawrs ahy ko͝od haev haed thɪs baek hohm juhst bahy ahs-king fawr ɪt, buht ɪt wo͝od haev bɪn kuhn-si-durd taek-ee. heer ik-sehs ɪz pre-steezh ae-nd pre-steezh ɪz dɪ-spleyd bahy ik-sehs. ev-ree pees uhv fur-ni-chur ɪn heer wuhz hand-mayd bahy uh skild hyoo-muhn krahfts-muhn.\n\n**Meaning in Persian:**\nالبته من می‌توانستم این را در خانه داشته باشم فقط با درخواست؛ اما این کار کم‌ارزش محسوب می‌شد. در اینجا افراط نشانه‌ی اعتبار است و اعتبار با افراط نشان داده می‌شود. هر قطعه از اثاثیه اینجا توسط یک صنعتگر انسانی ماهر با دستان خودش ساخته شده است.\n\n**Meaning in English:**\n- **Of course I could have had this back home just by asking for it, but it would have been considered tacky.**  \n  - Means that the speaker could easily obtain the same thing at their home without much effort, but doing so would be seen as in poor taste or socially unacceptable.\n  \n- **Here excess is prestige and prestige is displayed by excess.**  \n  - This suggests in the current context, having more than what is necessary or abundant possessions is a sign of respect, status, and honor. The realization of status is shown by having things in abundance.\n  \n- **Every piece of furniture in here was hand-made by a skilled human craftsman.**  \n  - Refers to the quality and uniqueness of the furniture, emphasizing the value of the work done by expert artisans, highlighting it’s not mass-produced but made with skilled hands.",
    "schmoozing": "schmoozing\n\nsh-moo-zing  \nخودمانی صحبت کردن  \n\"Schmoozing\" refers to engaging in informal, friendly conversation, often with the intent of gaining favor, making connections, or creating a good impression. It is commonly used in social or business contexts where networking is important.",
    "castrated": "kas-trey-tid  \nاخته  \nThe word \"castrated\" refers to the removal of the testicles or the ability to reproduce, typically applied to male animals or humans. It can be used in both a literal and metaphorical sense. In a literal sense, it refers to surgical or chemical castration. Metaphorically, it can mean depriving someone or something of power, vitality, or effectiveness.",
    "milled around aimlessly": "**mild eround eym-lis-lee**\n\nپرسه زدن بدون هدف\n\n\"Milled around aimlessly\" is a phrase used to describe people moving around a place without any particular purpose or direction, almost as if wandering or idling. It often conveys a sense of inactivity or lack of focus.",
    "petulant": "pet-yuh-luhnt  \nزودرنج، بدخلق  \n\"Petulant\" is an adjective used to describe a person who is childishly sulky or bad-tempered, often over something that is not important. It conveys a sense of irritability and unreasonable irritation.",
    "coyness": "coy-ness  \nشرم و حیا، ناز، عشوه  \n\"Coyness\" is a noun that refers to the quality of being shy or modest, often in a playful or flirtatious manner. It can describe behavior typically intended to attract attention by playing hard to get or by not revealing too much about oneself.",
    "inflections": "in-flek-shuhnz  \nصرف‌ها / تغییرات  \n\"Inflections\" refers to the variations in the form of a word, usually through the addition of prefixes, suffixes, or changes in the word's internal structure, to express different grammatical categories such as tense, mood, voice, aspect, person, number, gender, and case in languages. In the context of language, it is often related to how verbs, nouns, adjectives, and pronouns change their form to convey these grammatical relations.",
    "despised": "de-spahyzd  \nتحقیر شده / مورد نفرت  \n\"Despised\" is an adjective meaning something or someone that is looked down upon with contempt or regarded with strong dislike or scorn.",
    "blight": "blahyt  \nآفت، فساد  \n\"Blight\" is a noun that refers to:\n1. A plant disease, especially one caused by fungi such as mildews, rusts, and smuts, which can result in wilting and death of the plant. In Persian, this is translated to \"آفت\".\n2. Any cause of impairment, destruction, ruin, or frustration. For example, poverty can be described as a social or economic \"blight.\" In this context, it can also be translated to \"فساد\" when describing a situation or condition that spoils or damages.",
    "flounder": "floun-der\n\n1. دست و پا زدن\n2. گیج شدن یا تقلا کردن\n\n1. \"Flounder\" as a verb means to struggle or to have difficulty, either physically or metaphorically. For example, you might \"flounder\" in water if you are struggling to swim, or \"flounder\" in a task or situation where you find it difficult to proceed successfully.\n\n2. In a biological context, \"flounder\" is also a noun referring to a type of flatfish found in various oceans. However, this meaning is less commonly used in everyday conversation compared to the verb form.",
    "inadvertently": "**in-uhd-vur-tnt-lee**  \nناخواسته / ناآگاهانه  \n\"Inadvertently\" is an adverb used to describe an action that is done unintentionally or without being aware. It refers to something that happens accidentally or without deliberate planning.",
    "depriving": "de-pry-ving  \nمحروم کردن  \n\"Depriving\" is a verb that means taking something away from someone or preventing them from having or enjoying something. For example, depriving someone of their rights means not allowing them to have their rights.",
    "hostile": "hos-tahyl\n\nخصمانه\n\n\"Hostile\" is an adjective used to describe something or someone that is unfriendly, antagonistic, or opposed. It often refers to an environment or interaction that is aggressive or adversarial. For example, a hostile attitude is when someone is openly unfriendly or confrontational, and a hostile environment is one that feels threatening or unsafe.",
    "foregoing": "for-goh-ing  \nگذشته  \n\"Foregoing\" is an adjective and can also function as a noun. As an adjective, it refers to something that has been mentioned or stated earlier. In legal or formal documents, it usually pertains to the content that precedes it. As a noun, it refers to what has been said or written earlier.",
    "obedience": "o-bee-dee-uhns  \nاطاعت  \n\"Obedience\" refers to the act of following orders, rules, or requests from someone in authority. It involves complying with instructions and showing willingness to submit to a command or rule.",
    "decisive": "di-sahy-siv  \nقاطع  \n\"Decisive\" is an adjective used to describe someone or something that makes decisions quickly and effectively, or an action that is conclusive and leaves no doubt. It often implies certainty and determination in the context of decision-making or actions. Another context could be a decisive moment or event that has a significant impact on an outcome.",
    "literate": "lit-er-it  \nباسواد  \n\"Literate\" is an adjective used to describe someone who is able to read and write. It can also refer to a person who is knowledgeable in a specific area or well-educated more generally.",
    "rebel": "rebel (noun: reh-buhl, verb: ri-bel)\n\n1. شورشی (shur-uh-shi)\n   - Meaning in English: As a noun, \"rebel\" refers to a person who rises in opposition or armed resistance against an established government or ruler.\n\n2. یاغی (yaaghi)\n   - Meaning in English: Also as a noun, \"rebel\" can describe someone who resists authority, control, or tradition.\n\n3. طغیانگر (togh-yaan-gar)\n   - Meaning in English: This refers to someone who is rebellious or partakes in rebellion.\n\n4. سرکش (sar-kash)\n   - Meaning in English: This adjective describes someone who is disobedient, defiant, or resistant to authority or control.\n\n5. شورش کردن (shur-esh kar-dan)\n   - Meaning in English: As a verb, \"to rebel\" means to resist or fight against authority or control.\n\n6. طغیان کردن (togh-yaan kar-dan)\n   - Meaning in English: This verb implies engaging in rebellion or uprising against authority.\n\nEach context varies slightly, but they all revolve around the idea of resistance or defiance against authority or the normative order.",
    "affirmative": "af-fur-muh-tiv  \nمثبت\n\n\"Affirmative\" is an adjective that commonly means \"positive\" or \"agreeing with a statement or request.\" It is often used in contexts like answering a question in the positive (e.g., \"affirmative reply\" meaning \"yes\"). In a military context, it can signal agreement or confirmation, similar to saying \"yes, sir\" or simply \"yes.\"",
    "attainment": "at-teyn-muhnt  \nدست‌یابی  \n\"Attainment\" refers to the act of achieving or accomplishing something, usually after effort or endeavor, such as reaching a goal or achieving success in a particular area.\n\nتحقق  \nIn another context, \"attainment\" can mean the realization or fulfillment of a plan or goal, signifying the completion or achievement of a desired outcome.",
    "conspicuous": "con-spik-yoo-uhs  \nواضح، آشکار، جلب توجه کننده  \n\"Conspicuous\" is an adjective used to describe something that is easily seen or noticeable, often because it is unusual or stands out from its surroundings. It can also refer to something or someone that attracts attention due to being particularly impressive or striking.",
    "modesty": "mod-uh-stee  \nتواضع / فروتنی / حجاب  \n\n1. تواضع / فروتنی  \n   - Meaning: Modesty in this context refers to the quality of being humble and not thinking too highly of oneself. It's about having a balanced view of one's abilities and successes and not showing off or boasting.\n\n2. حجاب  \n   - Meaning: In some contexts, modesty can refer to the concept of dressing or behaving in a way that is intended to avoid attracting too much attention, often related to cultural or religious practices.",
    "confabulate": "con-fab-yuh-leyt\n\nهم‌سخنی کردن / صحبت خودمانی کردن / گفت و شنود\n\n\"Confabulate\" is a verb that means to engage in conversation or talk informally. It is often used to describe friendly or casual discussions. In a psychological context, it can also refer to the phenomenon where a person creates false memories without the intention to deceive, often filling in gaps in memory with fabricated details. The first meaning is much more common in everyday language.",
    "bogus": "boh-guhs  \nجعلی  \n\n\"Bogus\" is an adjective used to describe something that is not genuine or fake. It is commonly used to refer to counterfeit items, false information, or anything that is deceptive in nature.",
    "ailing": "ail-ing  \nبیمار  \n\"Ailing\" is an adjective used to describe someone who is ill or not in good health. It can also be used more broadly to refer to something that is in poor condition or functioning poorly, such as an organization or economy.",
    "perceptive": "per-sep-tiv  \nتیزبین / زیرک  \n\"Perceptive\" is an adjective used to describe someone who is able to notice or understand things quickly and accurately. A perceptive person is insightful and observant, often able to pick up on subtle details or clues that others might miss.",
    "abundant": "uh-buhn-duhnt  \nفراوان (farâvân)  \n\"Abundant\" is an adjective used to describe something that exists or is available in large quantities; plentiful or more than enough.",
    "monastery": "mahn-uh-stehr-ee  \nصومعه  \nA \"monastery\" is a building or complex where monks live and practice their religious devotions. It is a place for communal religious life, often characterized by vows of silence, poverty, and celibacy. Monasteries are typically associated with certain branches of Christianity, such as Catholicism and Eastern Orthodoxy, but similar institutions exist in religions like Buddhism and Jainism.",
    "cohort": "co-hawrt\n\n۱. گروه یا دسته\n۲. کوهورت\n\n۱. A cohort is often used to refer to a group of people who have shared a particular experience at a given time. For example, \"a cohort of students\" refers to a group of students who entered an educational institution during the same year.\n\n۲. In statistical and medical contexts, \"cohort\" can also refer to a group of subjects with a shared characteristic, such as age or exposure to a factor, over a certain period for research purposes.",
    "trifecta": "tri-fek-tuh  \nتری‌فکتا  \n\"Trifecta\" is a noun that has a couple of meanings:\n\n1. **Horse Racing Context**: In horse racing, a trifecta is a bet in which the person betting must predict which horses will finish first, second, and third in exact order. In this context, it's a type of wagering or gambling term.\n\n2. **General Context**: Beyond horse racing, \"trifecta\" is used more broadly to describe a situation that involves three successful outcomes or achievements. For example, achieving a \"trifecta\" might refer to succeeding in three critical areas such as completing three important projects on time, each within budget, and to high quality.",
    "virtues": "vir-chooz\n\nفضائل\n\n\"Virtues\" refers to moral excellence and righteousness; it's about having qualities considered morally good or desirable in a person. In a more specific context, it can refer to particular traits such as honesty, courage, compassion, and integrity. In philosophical or theological discussions, virtues are often discussed as qualities that are beneficial to oneself and society.",
    "virtue": "vir-choo  \nفضیلت  \n\"Virtue\" refers to a quality considered morally good or desirable in a person, such as integrity, honesty, courage, or kindness. It represents positive characteristics and traits that contribute to overall moral excellence.",
    "Heritability": "heh-ri-tuh-bil-i-tee  \nوراثت‌پذیری  \n\"Heritability\" refers to the proportion of observed variation in a particular trait (like height, intelligence, etc.) within a population that can be attributed to genetic factors, as opposed to environmental factors. It is commonly used in genetics and psychology to understand how much genetics contribute to individual differences in traits.",
    "hastily": "has-til-ee  \nعجولانه\n\n\"Hastily\" is an adverb used to describe an action done with excessive speed or urgency, often without careful consideration. It implies that something was done quickly, possibly too quickly, leading to a lack of thoroughness or possible mistakes.",
    "unprecedented": "un-pre-se-den-ted  \nبی‌سابقه\n\n\"Unprecedented\" is an adjective used to describe something that has never happened before or is without previous example; novel and unique in its occurrence.",
    "conspicuously": "con-spik-yoo-uhs-lee  \nبه‌طور آشکار  \n\"Conspicuously\" is an adverb used to describe something that is done or appears in a way that is very noticeable or obvious.",
    "inadequate": "in-ad-i-kwit\n\nناکافی\n\n\"Inadequate\" is an adjective used to describe something that is not sufficient, enough, or satisfactory for a particular purpose or requirement. It indicates a lack of quality, quantity, or ability that is necessary in a given context.",
    "giant all-encompassing": "giant all-encompassing  \njahy-uhnt awl-en-kom-puh-sing  \n\nغول‌آسا و فراگیر  \nThis phrase is used to describe something extremely large that includes or covers everything.  \n\nExplanation:  \n- \"Giant\" refers to something very large or massive.\n- \"All-encompassing\" means that it includes or covers everything, leaving nothing out. This phrase can be used in various contexts, such as describing a massive project, comprehensive plan, or a broad idea that covers all aspects.",
    "patriotic": "pay-tree-ah-tik  \nمیهن‌پرست  \n\"Patriotic\" is an adjective used to describe a person who has or expresses a strong love, devotion, and support for their country.",
    "boast": "bohst\n\nخودستایی\n\n\"Boast\" is a verb that means to talk with excessive pride and self-satisfaction about one's achievements, possessions, or abilities. It can also be used as a noun to refer to the act of boasting or something someone boasts about.",
    "disposed": "dih-spohzd\n\n1. متمایل\n   - \"Disposed\" as an adjective can mean having a tendency or inclination towards something. For example, \"She was disposed to trust him.\"\n\n2. آماده\n   - In another context, \"disposed\" can mean being prepared or willing to do something. For example, \"He was disposed to help at any time.\"\n\n3. دور انداخته شده\n   - As a past participle, \"disposed\" can refer to something that has been thrown away or gotten rid of. For example, \"The waste was disposed of properly.\"\n\n4. برطرف شده\n   - In legal or formal contexts, \"disposed\" can mean having dealt with a situation or a case, for example, \"The case was disposed in court yesterday.\" \n\nIn general usage, to be \"disposed\" refers to a person's readiness or willingness to act in a particular way or the state of something being discarded or handled. The meaning often depends on the surrounding text for clarity.",
    "penance": "pe-nuhns\nتوبه، کفاره\n\"Penance\" is a noun that refers to an act of self-punishment or religious devotion performed to show sorrow or repentance for sin. It is often used in religious contexts to describe actions such as prayer, fasting, or voluntary suffering to make amends for wrongdoing.",
    "abhorrent": "ab-hawr-uhnt  \nمنزجرکننده  \n\"Abhorrent\" is an adjective used to describe something that is causing or deserving strong dislike or hatred. It refers to things that are repulsive or offensive to the mind, often on moral grounds.",
    "meritorious": "mer-i-tawr-ee-uhs\nشایسته، قابل تقدیر\n\"Meritorious\" is an adjective used to describe someone or something that deserves praise or reward due to commendable qualities, actions, or achievements. It often suggests a level of excellence that is recognized and honored.",
    "discerned": "dis-sernd\nتشخیص داده شده\n\"Discerned\" is the past tense of the verb \"discern,\" which means to perceive or recognize something, often something that is not immediately obvious. It involves noticing or understanding differences, often requiring careful observation or insight.",
    "impoverished": "im-pov-er-isht  \nفقیر\nThe word \"impoverished\" is an adjective used to describe a person, area, or nation that is very poor and lacking in financial resources. It can also refer to something that has been made weaker or worse in quality or condition.",
    "ecological": "e·co·log·i·cal (ih-koh-loj-i-kuhl)\n\nبوم‌شناختی\n\n\"Ecological\" is an adjective used to describe anything related to ecology, which is the branch of biology that studies the interactions between living organisms and their environment. It often refers to the relationships and dependencies between plants, animals, and their surroundings, emphasizing the importance of understanding and maintaining the natural balance and health of ecosystems.",
    "bewildering": "be-wil-der-ing  \nگیج‌کننده، حیرت‌آور  \n\"Bewildering\" is an adjective used to describe something that is extremely confusing or perplexing, often because of its complexity, unexpected nature, or vastness.",
    "masquerading": "mas-kuh-rey-ding\n\nمبدل‌پوشی، وانمود کردن\n\n\"Masquerading\" can have multiple meanings:\n\n1. **مبدل‌پوشی (Mobadeel-Pooshi)**: This refers to the act of wearing a disguise or costume, often for the purpose of attending a masquerade ball or party. In this context, it implies physically covering one's true identity with a mask or costume.\n\n2. **وانمود کردن (Vaanamood Kardan)**: This refers to pretending to be someone or something that you're not, often for deceitful or strategic reasons. In this context, \"masquerading\" implies concealing one's true intentions or identity behind a false appearance. \n\nIn general, \"masquerading\" signifies the act of disguising or pretending to be someone else, either physically with a costume or metaphorically by misrepresenting one's identity or motives.",
    "epitome": "e-pit-uh-mee  \nمظهر، نمونه  \n\n\"Epitome\" is a noun used to describe a person or thing that is a perfect example of a particular quality or type. It often refers to an embodiment or the best representation of a certain trait or characteristic.",
    "lest": "lest  \nلِست  \nمبادا / که مبادا  \n\n\"Lest\" is a conjunction used in English to express the idea of preventing something undesirable from happening. It is often used to introduce a clause that indicates a negative outcome that should be avoided. For example, \"He wore a raincoat lest he get wet\" means \"He wore a raincoat to avoid getting wet.\" It is considered somewhat formal or literary in modern English usage.",
    "legislate": "leg-is-layt  \nقانون‌گذاری کردن  \n\"Legislate\" is a verb that means to make or enact laws. It refers to the process of creating legal regulations and rules, typically performed by a legislative body such as a parliament or congress.",
    "amortized": "uh-mawr-tahyzd\n\nاستهلاک شده\n\n\"Amortized\" is an accounting and finance term used to describe the gradual repayment or reduction of a debt over time through periodic payments. It can also refer to the process of spreading out the cost of an intangible asset over its useful life. When a loan is amortized, each payment contributes to both the principal and the interest, ultimately reducing the outstanding balance to zero by the end of the term.",
    "histrionics": "his-tree-on-iks  \nنمایش‌های تصنعی / واکنش‌های نمایشی\n\n\"Histrionics\" generally refers to exaggerated dramatic behavior designed to attract attention. It can be used to describe overly emotional or theatrical expressions, often implying insincerity or the intention to manipulate others. In everyday conversation, it might refer to someone making a big scene over something minor.",
    "absorb": "ab-zawrb  \nجذب کردن  \nTo \"absorb\" means to take in or soak up a substance or information. It can also refer to the way a material takes in a liquid or gas, or how a person takes in information or experiences. Here are a few contexts for its use:\n\n1. جذب کردن (jazb kardan) - This is used when a liquid or gas is taken in by a solid or another liquid. For example, a sponge absorbs water.\n\n2. فرا گرفتن (farā gereftan) - This can be used when a person is taking in information, such as learning new knowledge or understanding.\n\n3. مشغول شدن (mashghool shodan) - This context is more abstract and refers to becoming fully engaged or involved in something, like how someone might get absorbed in a book.",
    "contemplating": "con-tem-pla-ting  \nتفکر کردن / تأمل کردن  \n\n\"Contemplating\" is a verb used to describe the action of thinking deeply or carefully about something. It often involves giving serious consideration to a subject or pondering over a decision or possibility.",
    "resembling": "re·sem·bling  \nشبیه  \n\"Resembling\" is a verb in its present participle form, meaning that something looks like or is similar to something else. It is used to indicate likeness or similarity in appearance or characteristics.",
    "blithely": "blahyth-lee  \nبی‌ملاحظه, بی‌خیال\n\n\"Blithely\" is an adverb that can be used in two primary contexts:\n\n1. Carefree or Happy: When someone acts blithely, it means they are doing something in a carefree or happy manner, without worrying about potential consequences. For example, \"He blithely sang as he walked down the street.\"\n\n2. Indifferent or Unconcerned: It can also imply that someone is being indifferent or unconcerned about something important, potentially in a way that's considered careless or thoughtless. For example, \"She blithely ignored the warning signs.\"",
    "dour": "dawr\n\nعبوس\n\n\"Dour\" is an adjective used to describe someone who is stern, severe, or unfriendly in appearance or demeanor. It often conveys a sense of gloominess, stubbornness, or harshness.",
    "adversity": "ad-vur-si-tee  \nسختی، مشقت، ناملایمات  \n\n**سختی، مشقت**: This refers to hardships or difficulties in life. It is used when describing tough situations or challenges that one may face.  \n\n**ناملایمات**: This translates to adversities or misfortunes, often used in a context where one is experiencing multiple difficult situations or misfortunes over time.  \n\nIn English, \"adversity\" refers to a state of hardship or affliction; it encompasses various challenges or difficult situations that one may encounter. The term is often used to highlight resilience in overcoming difficulties.",
    "chipper": "Here is the translation and explanation for the word \"chipper\":\n\n**chip-er**\n\nشاداب; سرحال\n\n\"Chipper\" is an adjective used to describe someone who is in a cheerful and lively mood. It can also refer to a bright and energetic disposition. This term is often used in informal contexts to convey that someone is feeling good, upbeat, or energetic.",
    "exiled": "ek-sahyld  \nتبعید شده  \n\"Exiled\" refers to a person who has been expelled or banished from their country or home, often for political reasons or as a form of punishment. It describes a state of being forced to live away from one's native country.",
    "weeping": "weep-ing  \nگریه  \n\"Weeping\" is the act of shedding tears, usually as an expression of emotions such as sadness, sorrow, or joy. It refers to crying or sobbing, and can also be used metaphorically to describe things that seem to be overflowing or filled with an excess of emotion, such as \"weeping willows\" which seem to droop like someone crying.",
    "contentment": "con-tent-muhnt  \nرضایت، خرسندی  \n\"Contentment\" is a noun that describes a state of happiness and satisfaction; a feeling of being pleased with one's situation or what one has. It is a sense of peace and tranquility, often associated with a lack of desire for something more or different.",
    "unimpaired": "un-im-paird  \nبی‌عیب و نقص، سالم  \n\"Unimpaired\" is an adjective used to describe something that is not damaged, weakened, or diminished. It means functioning well and in good condition without any limitations or reductions in quality or effectiveness. For example, having unimpaired vision means that one's eyesight is completely normal and not affected by any impairment.",
    "strenuous": "stren-yoo-uhs  \nپرتلاش / طاقت‌فرسا  \n\"Strenuous\" is an adjective used to describe an activity or task that requires a lot of effort, energy, or strength. It can refer to both physical and mental efforts. For example, a strenuous workout involves a lot of physical exertion, while a strenuous job might be mentally demanding.",
    "ensconced": "en-skonsd\nآرام و راحت مستقر شدن / پناه گرفتن\n\n\"Ensconced\" is an adjective used to describe someone or something that is settled in a safe, comfortable, or secret place. It often implies a sense of being securely or snugly positioned.",
    "ensues": "en-sooz\nدر پی\n\"Ensues\" is a verb that means something happens or occurs as a result of another event. It often implies a sequence of events where one event leads to another, typically in a cause-and-effect relationship.",
    "driveway": "**drahyv-wey**  \nراه‌ورودی،‌ پارکینگ  \nA \"driveway\" is a short road leading from a public road to a house or garage. It is a private path for vehicles, often connecting the street to a garage or parking area in front of a home.",
    "perishable": "per-i-shuh-buhl  \nفاسدشدنی  \n\"Perishable\" is an adjective used to describe items, especially food, that are likely to decay or go bad quickly. These are items that have a limited shelf life and need to be consumed or preserved promptly to prevent spoilage.",
    "permeate": "per-mee-eyt  \nنفوذ کردن، پخش شدن  \n\"Permeate\" is a verb that means to spread throughout something or to penetrate something completely. It is often used to describe how a substance, like a liquid or gas, spreads through another substance or environment. For example, when a smell permeates a room, it means the smell has spread throughout the entire space.",
    "bikeshed": "bike-shed  \nانبار دوچرخه  \n\n\"Bikeshed\" can have a couple of meanings depending on the context:\n\n1. **Literal Meaning**:  \n   بایکسِد معمولاً به معنای واقعی خودش به عنوان \"انبار دوچرخه\" به‌کار می‌رود.  \n   It refers to a physical structure where bikes are stored or parked.\n\n2. **Metaphorical/Colloquial Meaning (Bikeshedding)**:  \n   \"Bikeshedding\" is a term in project management and decision-making used metaphorically. It describes the phenomenon where people focus on trivial details while avoiding more complex, important topics. This term comes from Parkinson's Law of Triviality, where people would waste time debating the design of a bikeshed instead of addressing larger issues.",
    "parable": ".word\n Definition:\n1. :a usually short fictitious story that illustrates a moral attitude or a religious principle\n\n2. :a short simple story illustrating a moral or spiritual truth\n Examples:\n1. He told the children aparableabout the importance of forgiveness.theparableof the Good Samaritan",
    "detractors": "\nDefinition:\n1. :to diminish the importance, value, or effectiveness of something\n2. :divert\n3. :to speak ill of\n4. :to take away\n5. :to take away some of the value or importance\nExamples:\n1. numerous typos in the textdetractthe reader's attention from the novel's intricate plot",
    "invariants": "\nDefinition:\n1. :constant,unchanging\n2. :not changing or altering\nExamples:\nNo examples found.",
    "bumper-to-bumper traffic": "buhm-puhr-too-buhm-puhr trafik\n\nترافیک سنگین یا ترافیک به هم چسبیده\n\n\"Bumper-to-bumper traffic\" refers to a situation where vehicles are moving very slowly or are at a complete stop, usually because the road is heavily congested with cars. The term comes from the idea that the cars are so close to each other that their bumpers are nearly touching. It's commonly used to describe traffic jams during rush hour or in busy urban areas.",
    "meticulously": "muh-tik-yuh-luhs-lee  \nبا دقت  \n\"Meticulously\" is an adverb used to describe an action done with great attention to detail and precision, often implying careful and thorough execution.",
    "dreadful": ".word\nDefinition:\n1. :inspiring dread (seedreadentry2sense 1a):causing great and oppressive fear\n2. :extremely bad, distasteful, unpleasant, or shocking\n3. :extreme\n4. :a cheap and sensational (seesensationalsense 2) story orperiodical\n5. :causing dread or awe\n6. :very disagreeable, unpleasant, or shocking\nExamples:\n1. AdjectiveHer performance was absolutelydreadful.Those children have suchdreadfulmanners.",
    "adages": ".w  \nضرب‌المثل‌ها  \nad-ij-iz  \nPopular sayings or proverbs that convey a general truth or piece of wisdom.",
    "prevailing": ".word\nDefinition:\n1. :to gain ascendancy through strength or superiority:triumph\n2. :to be or become effective or effectual\n3. :to use persuasion successfully\n4. :to be frequent:predominate\n5. :to be or continue in use or fashion:persist\n6. :to win against opposition:be successful\n7. :to urge successfully\n8. :to be frequent\n9. :to obtain substantially the relief or action sought in a lawsuit\n10. :to be frequent or predominant\nExamples:\n1. Mutual respectprevailsamong students and teachers here.The house was built in the style thatprevailedin the 1980s.The law stillprevailsin some states.",
    "irrepressibly": ".word\nDefinition:\n1. :impossible to repress, restrain, or control\n2. :impossible to repress or control\nExamples:\n1. She has anirrepressiblesense of humor.",
    "mundane": ".word\nDefinition:\n1. :of, relating to, or characteristic of the world\n2. :characterized by the practical,transitory, and ordinary:commonplace\n3. :of or relating to the world:worldly\n4. :having to do with the practical details of everyday life\nExamples:\n1. On him, amundanenavy blazer looked like an Armani dinner jacket; around him, a dusky locker room became the chandeliered lobby of the Savoy.—Curry Kirkpatrick,ESPN,19 Mar. 2001How did our ancestors pass from themundaneactivity of counting to the concept of 'number' in the abstract, devoid of any particular collection of objects to label?—John D. Barrow,Pi in the Sky,1992They decided on buttock tattoos, rather than the moremundaneengagement ring, because a tattoo is permanent. You can always pawn a ring.—Mike Royko,Chicago Tribune,25 Aug. 1988The day began with themundanebusiness of getting my white chiffon dress shortened …—Lady Bird Johnson,January 14, 1964,inA White House Diary,1970mundanechores, like washing dishesThey lead a prettymundanelife.prayer and meditation helped her put hermundaneworries asideSee More",
    "pervasive": ".word\nDefinition:\n1. :existing in or spreading through every part of something\n2. :spread throughout so thoroughly as to be seen or felt everywhere\nExamples:\n1. A resuscitated orthodoxy, sopervasiveas to be nearly invisible, rules the land.—Mark Slouka,Harper's,November 2004The manic money-grab excitement of the Nineties had never been altogether free of ourpervasiveAmerican guilt.—Norman Mailer,New York Review of Books,27 Mar. 2002Race was never articulated as an issue at the trial, even though its presence waspervasive.—Howard Chua-Eoan,Time,6 Mar. 2000thepervasivenature of the problemtelevision'spervasiveinfluence on our culture",
    "deceptively": ".word\nDefinition:\n1. :tending or having power to cause someone to accept as true or valid what is false or invalid:tending or having power todeceive\n2. :tending or having power to deceive:misleading\n3. :tending or having capacity to deceive\nExamples:\n1. in hisdeceptiveanswer about the vehicle's history, the salesman said that the used car had never been hit by another cara mail-order firm indicted fordeceptivebusiness practices",
    "tractable": ".word\nDefinition:\n1. :capable of being easily led, taught, or controlled:docile\n2. :easily handled, managed, or wrought:malleable\n3. :easily led, taught, or controlled\nExamples:\n1. This new approach should make the problem moretractable.He's a verytractablechild.",
    "disconsolate": "dis-con-so-late  \nناراحت، غمگین  \n\"Disconsolate\" is an adjective used to describe someone who is deeply unhappy or unable to be comforted, often due to loss or sorrow. It conveys a sense of being so sad that one cannot find solace or cheer.",
    "bleak": "bleek  \nغم‌انگیز، دلگیر  \n\"Bleak\" is an adjective that can describe something that is depressing, gloomy, or lacking in warmth and cheerfulness. It can also refer to a situation or environment that is harsh, empty, or exposed, offering little or no hope or prospects.  \n\nSome additional contexts:  \n1. When describing weather or landscapes: It refers to a cold, desolate, and often windswept environment.  \n2. When describing a situation: It implies a lack of hope or a grim outlook.  \n3. When describing a person's expression or tone: It can mean that it is dismal or without any sign of comfort or positivity.",
    "laudable": "Law-duh-buhl  \nستودنی / تحسین‌برانگیز  \n\"Laudable\" is an adjective used to describe something that is deserving of praise or commendation. It refers to actions, qualities, or efforts that are worthy of approval and admiration.",
    "sedately": "se-dait-lee  \nآرام و با وقار  \n\"Sedately\" is an adverb that describes doing something in a calm, dignified, and unhurried manner. It often implies a sense of seriousness or formality in the way an action is performed.",
    "Stork": "stork  \nزاغه  \nA \"stork\" is a large wading bird known for its long legs and neck and often associated with delivering babies in folklore. In many cultures, it is seen as a symbol of renewal and new beginnings.",
    "resent": "res-ent  \nرنجش‌کشیدن  \n\"Resent\" is a verb that means to feel bitterness or indignation at having been treated unfairly or having to bear something unpleasant. It often implies holding onto negative feelings in response to a perceived injustice or grievance. \n\nرنجاندن  \nIn some contexts, \"resent\" can also mean to cause someone to feel resentment. This is used when someone's actions or words lead another person to feel bitterness. \n\nOverall, \"resent\" conveys the idea of feeling hurt and angry about something, often due to feelings of unfair treatment.",
    "Preamble": "pre-am-buhl  \nمقدمه  \nThe term \"Preamble\" refers to an introductory statement or preliminary explanation of a document or speech, often used to outline the reasons for its existence or the principles it is based upon.",
    "precarious": "precarious\n\nprih-kair-ee-uhs\n\nناامن\n\"Precarious\" is an adjective used to describe a situation or condition that is unstable, uncertain, or subject to risk, often implying that it can change suddenly and without warning.\n\nناپایدار\nIn some contexts, \"precarious\" can refer to something that is not firmly held in place or lacks permanent stability, suggesting that it can fall, fail, or be lost easily.",
    "trucuently": "truculent\n\ntruhk-yuh-luhnt  \nخشن،unyet  \n\"Truculent\" is an adjective that describes someone or something that is eager to fight, defiant, or aggressive in nature. It can also refer to a fierce or savage attitude, often showing a readiness to argue or challenge others.",
    "defiant": "def-i-uhnt  \nسرکش  \n\"Defiant\" is an adjective used to describe someone who boldly resists or challenges authority, control, or an opposing force. It conveys a sense of rebellion and unwillingness to submit.",
    "jolly": "jol-ee  \nشنگول  \n\"Jolly\" is an adjective used to describe a person who is cheerful, happy, and full of good humor; it conveys a sense of joyfulness and lightheartedness.\n\njol-ee  \nشنگول و خرم  \nIn some contexts, it can also mean lively and merry, especially during celebrations or festivities, indicating a festive and enjoyable atmosphere.",
    "confine": "con-fahyn  \nمحدود کردن / محصور کردن  \n\"Confine\" is a verb that means to restrict someone or something to a certain space or limit. It can also refer to preventing someone from leaving a place or from expressing themselves freely. In some contexts, it might be used to indicate keeping someone within certain bounds or confines, both physically or metaphorically.",
    "squealed": "squealed  \nskwee-uhld  \nجیغ‌زد  \n\"Squealed\" is the past tense of \"squeal,\" which means to make a high-pitched, loud cry or sound, often associated with surprise, fear, or pain. It can also refer to someone revealing information, especially in a way that betrays trust (e.g., \"squealed on someone\").",
    "scurrying": "scurrying  \nskur-ee-ing  \nدر حال دوان‌دوان  \n\"Scurrying\" is a verb that refers to the act of moving quickly and with short, rapid steps, often used to describe someone or something that is hurrying around in a frantic or busy manner. It is frequently associated with small animals (like mice) or people rushing to complete tasks.",
    "ditch": "ditch  \ndich  \nخندق / کوره / ترک کردن / رها کردن  \n\"Ditch\" has multiple meanings:  \n1. **خندق (khandaq)**: This refers to a long, narrow excavation in the ground typically used for drainage or irrigation.  \n2. **کوره (koreh)**: This meaning refers to a trench or a small channel, which can also be used for drainage purposes.  \n3. **ترک کردن (tark kardan)**: As a verb, to \"ditch\" means to abandon or leave something or someone behind, often casually or without consideration.  \n4. **رها کردن (rahā kardan)**: Similar to \"abandon,\" this usage implies letting go or leaving something behind, especially in a relationship context.  ",
    "anecdotes": ".w \nan-ek-dohts  \nقصه‌های کوتاه  \n\"Anecdotes\" are short, interesting, or amusing stories about real incidents or people, often shared to illustrate a point or provide insight into a topic.",
    "unwittingly": "un-wit-ting-lee  \nناخواسته  \n\"Unwittingly\" is an adverb meaning to do something without being aware of it or without intent. It refers to actions taken unintentionally or unknowingly.",
    "hinder": "hin-der  \nمقابله کردن  \n\"Hinder\" is a verb that means to create difficulties for someone or something, resulting in a delay or obstruction. It can refer to blocking progress, causing inconvenience, or making it harder to accomplish a task. \n\nممانعت کردن  \nThis is another meaning of \"hinder,\" which refers to the act of preventing something from happening by creating obstacles. It can be used in contexts where someone actively stops or delays an action or process.",
    "emissary": "em-i-sar-ee  \nنماینده، فرستاده  \n\"Emissary\" is a noun that refers to a person sent on a special mission, often as a diplomatic representative. An emissary may be sent to negotiate or communicate on behalf of an organization or government.",
    "rattled": "rat-uhld  \nآشفته  \n\"Rattled\" is the past tense of \"rattle,\" and it is often used to describe someone who is anxious, disturbed, or unsettled, usually due to a sudden shock or unexpected event. In a different context, it can also mean to make a series of quick, sharp noises, but this usage is not commonly referred to when describing emotions.",
    "allure": "al-yoor  \nفریبندگی  \nThe term \"allure\" refers to the quality of being powerfully and mysteriously attractive or fascinating. It can be used to describe a person, place, or thing that has a captivating charm.",
    "Unbeknownst": "un-bih-nohst  \nغافل از  \n\"Unbeknownst\" is an adjective that means \"unknown\" or \"without the knowledge of.\" It is often used in contexts where someone is unaware of a situation or event that is happening. For example, \"Unbeknownst to her, a surprise party was being organized.\"",
    "gusto": "guh-stoh  \nبا علاقه  \n\"Gusto\" is a noun that means great enthusiasm or enjoyment, especially in doing something. It is often used to describe a lively approach to activities, particularly when someone is eating, dancing, or participating in any enjoyable endeavor.",
    "depict": "depict\n\ndih-pikt  \nتصویر کردن  \n\"Depict\" is a verb that means to represent or show something in a particular form, especially through art, writing, or description. It often refers to illustrating or portraying an image or concept. \n\nAdditionally, it can also mean to describe someone or something in words, conveying a sense of how they look or behave.",
    "Apprenticeship": "ap-ren-tis-ship  \nکارآموزی  \n\"Apprenticeship\" refers to a system of training a new generation of practitioners of a trade or profession through practical experience under the guidance of a qualified worker. Typically, apprentices learn not only the specific skills required for the profession but also the theoretical knowledge needed to understand the job.",
    "aphorisms": "aphorisms  \nاَفوریزم‌ها  \nAn \"aphorism\" is a concise statement or observation that contains a general truth or principle. It's often a philosophical or moral saying that expresses an idea in a memorable and succinct way.",
    "tacit disdain": "tac-it dis-dane  \nبی‌اعتنایی ضمنی  \n\"Tacit disdain\" refers to an unspoken or indirect sense of contempt or a lack of respect that is evident through behavior or attitudes, even if it is not explicitly stated. It indicates a subtle form of disdain that does not need to be verbally expressed.",
    "gauged": "gauged\n\ngeɪjd  \nاندازه‌گیری شده / سنجیده شده  \n\"Gauged\" is the past participle of \"gauge,\" which means to measure or assess something, particularly in terms of size, amount, or value. It can also refer to estimating or evaluating an opinion or situation. In contexts such as engineering, science, or even informal discussions, it indicates that something has been measured or evaluated to obtain a specific understanding or result.",
    "Inoculate": "in-ok-yuh-layt  \nواکسینه‌کردن  \n\"Inoculate\" is a verb that means to introduce a vaccine into the body to produce immunity against a specific disease. It can also refer more broadly to instilling an idea or attitude in someone, especially an idea that is beneficial.",
    "pathos": "pathos\n\npey-thohs  \nپاتوس  \n\"Pathos\" is a noun that refers to an appeal to emotion in persuasive speech or writing, particularly a quality that evokes pity, sadness, or compassion. In rhetoric, it is a technique used to persuade an audience by appealing to their emotions.",
    "clenched": "clenched\n\nklencht\n\nمشت کرده / فشرده\n\n\"Clenched\" is the past participle of the verb \"clench.\" It is primarily used in two contexts:\n\n1. When referring to a fist or hand that has been tightly closed or held with force. For example, \"He walked with his fists clenched,\" meaning his hands were tightly closed in a fist as a sign of tension or anger.\n   \n2. It can also refer to the act of holding or pressing something tightly, often used in phrases like \"clenched jaw,\" which describes a jaw that is tightly held closed, often due to stress or rage.",
    "respite": "respite\n\nres-pit\n\nفرجه / مهلت / تنفس\n\n\"Respite\" is a noun that refers to a short period of rest or relief from something difficult or unpleasant. It can be used in the context of providing a break from stress, work, or challenging situations.",
    "cognitive dissonance": "cog-ni-tiv dis-o-nance  \nدissonance شناختی  \n\"Cognitive dissonance\" refers to the mental discomfort or tension experienced when a person holds two or more contradictory beliefs, values, or attitudes simultaneously, or when their behavior conflicts with their beliefs. In this context, individuals may feel a need to reconcile their beliefs with their actions to reduce this discomfort.",
    "pesky": "pes-kee  \nمزاحم  \n\"Pesky\" is an adjective used to describe something or someone that is annoying, troublesome, or causing minor irritation. It usually refers to bothersome situations, small nuisances, or minor inconveniences.",
    "apparatus": "ap-uh-rat-uhs  \nدستگاه  \n\"Apparatus\" refers to a complex structure or equipment designed for a specific purpose or function. It can also denote the set of tools or machinery needed to perform a particular activity.",
    "tread on eggs": "tread on eggs  \ntrɛd ɒn ɛɡz  \nروی تخم‌مرغ‌ها راه رفتن  \nTo \"tread on eggs\" means to act very carefully or delicately in a situation, often because the circumstances are sensitive or precarious. It implies that one must be cautious to avoid upsetting or provoking others. This expression typically conveys the need for tactfulness or diplomacy in handling fragile situations.",
    "asceticism": "as-ket-i-siz-um  \nزهد  \n\"Asceticism\" refers to a lifestyle characterized by the practice of severe self-discipline and abstention from all forms of indulgence, often for religious reasons. It is typically associated with spiritual or religious practices where individuals seek to achieve a higher state of existence or understanding through self-denial."
  },
  "last_synced_at": "2022-08-19T20:28:59.849Z"
}
